#ifndef __COMM_H__
#define __COMM_H__

/**************************************************************************************************************/
#define 	RECEIVE_TIMEOUT				20
/**************************************************************************************************************/
#define 	MIN_FRAME_LENGTH			8
/**************************************************************************************************************/
typedef struct
{
	u8 head1;
	u8 head2;
	u8 id;
	u8 destAddr;
	u8 srcAddr;
	u8 len;
}stCommHeader;
/**************************************************************************************************************/
#define 	HEAD1   0xAA
#define 	HEAD2   0x55
/**************************************************************************************************************/
#define 	PC_ADDR					0xF0
#define 	MAX_MCU_ADDR		0x0F

#define 	MAX_OK_RES_VALUE		95

/**************************************************************************************************/
// PC ==> MCU   注意，复位无法广播指令，因为要接力
#define 	CMD_ID_USERSET						0x01  //用户设置参数
#define 	CMD_ID_RESET							0x02  //复位
#define 	CMD_ID_CALIBRATION				0x03  //校验

#define 	CMD_ID_MEASURE						0x04  //是否成功（不实现）
#define   CMD_ID_IMPEDANCE          0x05  //阻抗（不实现）
#define   CMD_ID_PROBDETECTION      0x06  //探头检测
#define   CMD_ID_READOUT            0X07  //参数读出
#define   CMD_ID_CHECKGLAG          0x08  //检测标志位
/**************************************************************************************************/


/**************************************************************************************************/
typedef struct
{
	u16  maxmA;			//最大清洗电流  
	u8   maxCount;	//最大清洗次数
}stCleanPara;

/**************************************************************************************************************/
void debugFunc(void);
void testuart4Send(void);
void testuart5Send(void);
u16 crc16_modbus(u8 *data, u16 length);
void commFunc(void);
void sendOutToNext(u8 *buffer,u8 len);
//void ResponseReset(void);    //回复复位
//void ResponseSet(void);    //回复设置
//void ResponseReadSet(void);    //回复读参数
//void ResponseCalibration(void);    //回复校验
//void ResponseProbDection(void);    //回复探头检测
void Response(void);
void SendSetToPC(void);
/**************************************************************************************************************/

/**************************************************************************************************************/

/**************************************************************************************************************/

/**************************************************************************************************************/

/**************************************************************************************************************/


#endif
