/**************************************************************************************************/
#include "main.h"
/**************************************************************************************************/

#define 	UART_TX_SIZE			64
#define 	UART_RX_SIZE			64

/**************************************************************************************************/

extern char printf_buf[128];  // 共用缓冲区

extern FifoStruct UartCommInTxFifo;			//接收串口      from PC
extern FifoStruct UartCommInRxFifo;

extern FifoStruct UartTraceTxFifo;				//调试串口
extern FifoStruct UartTraceRxFifo;


extern FifoStruct UartCommOutTxFifo;			//发送串口      to MCU
extern FifoStruct UartCommOutRxFifo;



/**************************************************************************************************/

void initUartFifo(void);
void uart4Func(void);
void uart5Func(void);
//void u4_printf(const char *fmt, ...);
//void u5_printf(const char *fmt, ...);
/**************************************************************************************************/

/**************************************************************************************************/

/**************************************************************************************************/



/**************************************************************************************************/

